/* 服务协议常量
 * @Descripttion: 
 * @version: 
 * @Author: xiaowe
 * @Date: 2019-7-15 16:37:44
 * @LastEditors: xiaowe
 * @LastEditTime: 2019-7-15 16:37:40
 */

/**
 * 服务协议
 */
export let serviceAgreementData = [
    {class:'title',text:'寄件服务协议'},
    {class:'tips',text:'2019-07-16 15:11'},
    {class:'section',text:'特别提醒'},
    {class:'text',text:'快递单号是您查件或索赔的重要凭证，请务必将包裹转交给取件的工作人员时向其索要快递单号！'},
    {class:'section',text:'条款'},
    {class:'text',text:'本服务协议是您（以下简称“寄件人”）与服务平台的所有者深圳兆日国际旅行社有限责任公司（以下简称“本公司”）之间就服务平台提供的信息服务等相关事宜所订立的协议。'},
    {class:'text',text:'当您点击本协议"同意"按钮前，应当认真阅读本协议，请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、法律适用和争议解决条款。免除或者限制责任的条款将以粗体标识，您应重点阅读。阅读本协议的过程中，如果您不同意本协议条款，请立即停止使用服务。如您对协议有任何疑问，可向客服咨询。'},
    {class:'text',text:'您同意，本公司有权随时对本条款内容进行单方面的变更，无需另行单独通知您；若您在本条款内容变更后继续使用本服务，表示您已充分阅读、知悉并同意修订后的条款内容并回遵循修改后的条款内容使用本服务；若您不同意修改后的条款内容，您应停止使用本服务。'},
    {class:'section',text:'服务内容'},
    {class:'text',text:'为了提高您的寄件效率，服务平台为您提供的是以下技术服务：平台会向您所在的区域内提供相关快递公司的上门取件服务，您选择合适的服务商后 ，可以在线填写收寄件人信息及选择提供寄件服务的具体快递公司（以下简称“快递公司”），下单成功后，我们会通知服务商处理您的委托，服务商接受您的委托后会为您提供代寄包裹服务。'},
    {class:'text',text:'选择上门取件服务后，服务商会指派工作人员前往包裹所在地址进行取件，请您在此期间保持手机畅通；工作人员验视包裹内承运物品是否合规后，会为您统计包裹的价格，您可在现场与快递员确认支付费用及支付方式（寄方付，收方付）；'},
    {class:'text',text:'特别提醒：快递单号是您查件或索赔的重要凭证，请务必将包裹转交给取件的工作人员时向其索要快递单号！'},
    {class:'text',text:'寄件人义务：作为文明社会的每个公民都有责任和义务维护公共安全，恪守公共道德。国家法律、法规禁止寄递的物品（禁寄品）不可通过快递渠道寄递。服务商依法收寄托寄物，对信件外的包裹按照国家有关规定应当场验视，对禁寄物品和拒绝验视的物品不予收寄，寄件人应配合服务商对托寄物进行检视和验视。如发现禁止或限制寄递的物品，本公司有权移交相关部门处理，并配合相关部门追究你的法律责任。禁运详细请查看国家邮政局、公安部、国家安全部关于发布的《禁止寄递物品管理规定》。'},
    {class:'text',text:'您应阅读实际承运快递公司于其官方网站发布的关于寄件的契约文件（具体文件名称以快递公司为准，包括但不限于《快件运单契约条款》、《寄件承诺》、《快递服务协议》等），您于下单时选择该快递公司视为您已知悉并同意前述该等文件的所有条款。 若因您违反快递公司寄件的相关条款而导致的任何纠纷，由您与快递公司解决，本公司不承担任何责任。'},
    {class:'section',text:'免责信息'},
    {class:'sectionText',text:'您同意并理解，服务平台仅提供便捷的代寄件服务，但不保证您选择的服务商能在您预期时间内承接您的订单并处理。'},
    {class:'sectionText',text:'您同意并悉知，服务商收取包裹后到寄出交给快递公司前，包裹出现丢失、破损、发错快递、服务态度等问题由服务商承担责任；包裹交给快递公司后，包裹出现丢失、破损、送错地点、服务态度等问题由相应的快递公司承担责任，具体赔偿方式请您联系相应的快递公司客服，本公司与服务商不承担任何责任。'},
    {class:'section',text:'用户信息与隐私'},
    {class:'text',text:'为保证包裹安全送达，您应准确清楚的填写寄件人、收件人的名称、地址和联系电话等资料；若因为地址不正确、联系方式错误、收件人拒收等原因而造成快递公司无法派送包裹，您需要承担相应的责任和后果。'},
    {class:'text',text:'根据国家相关法律法规要求，寄快递需要实名登记；用户在服务平台下单后，需现场接受快递员的实名确认。'},
    {class:'text',text:'服务平台会严格保护您的用户信息，包括姓名、地址、联系方式等隐私信息，除非得到用户的授权或法律法规、本条款另有规定外，平台不会公开透露任何用户隐私信息。'},
    {class:'section',text:'违约赔偿责任'},
    {class:'text',text:'因托寄物质量缺陷或包装皮损，致使其他托寄物、运输工具、机械设备被污染腐蚀、损坏，或造成人身伤亡的，您应该承担赔偿责任。'},
    {class:'section',text:'其他'},
    {class:'text',text:'本协议适用中华人民共和国大陆地区法律。我们保留随时更改和修正本协议的权利，因本协议或本公司服务所引起或与其有关的任何争议应向深圳兆日国际旅行社有限责任公司所在地的法院提起诉讼。'},
    {class:'text',text:'若本协议条款中的某条款被法院或政府机构认定为无效或部分无效，则您同意除无效条款外仍应执行本协议其他有效条款。'},
]
