/****
 * productenum  商品相关枚举
 * 
 */
//供应商商品相关属性配置
export const supplierTypeEnum = {
    'JD':{
        showPriceRule:true
    },
    'EHSY':{
        showPriceRule:true
    }
}

//价格说明的内容
export const priceRule = '<p><span>1.销售价：</span>销售价为商品的卖价，是您最终决定是否购买商品的依据。</p><p><span>2.划线原价：</span>商品展示的划横线原价为参考价，并非原价，该价格可能是品牌专柜标价、商品吊牌价或由品牌供应商提供的正品零售价（如厂商指导价、建议零售价等）或其他真实有依据的价格；由于地区、时间的差异性和市场行情波动，品牌专柜标价、商品吊牌价等可能会与您购物时展示的不一致，该价格仅供您参考。</p><p><span>3.折扣：</span>如无特殊说明，折扣指销售商在销售价、或划线原价（如品牌专柜标价、商品吊牌价、厂商指导价、厂商建议零售价）等某一价格基础上计算出的优惠比例或优惠金额；如有疑问，您可在购买前联系客服进行咨询。</p><p><span>4.异常问题：</span>商品促销信息以商品详情页“促销”栏中的信息为准；商品的具体售价以订单结算页价格为准；如您发现活动商品售价或促销信息有异常，建议购买前先联系客服咨询。</p>'
            
