//酒类第一页
let wineDefault0 = [{"sku":"100005907830","name":"五粮液52度普五第八代款单瓶500毫升","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/80692/4/3509/178776/5d1afa05E1b4d3001/1e800fa6c3b91e45.jpg"},{"sku":"100003547337","name":"五粮液52度普五第八代款整箱装500ml*6瓶","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/52129/37/4016/259405/5d1b06a9E101f7b83/5222e49926ebfb24.jpg"},{"sku":"6120121","name":"洋河蓝色经典 梦之蓝 M9 52度 礼盒装 500ml*2瓶 口感绵柔浓香型 高度白酒","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/154521/13/8122/205106/5fc750f7E14341990/1fea899e1a478194.jpg"},{"sku":"4838539","name":"泸州老窖 国窖1573 礼盒装 52度 浓香型白酒 500ml*2瓶（新老包装随机发货）","imagePath":"https://img13.360buyimg.com/n0/jfs/t9055/67/1175831614/103033/69074082/59b5ee25Nf786643c.jpg"}] 
let wineDefault1 = [{"sku":"100006811901","name":"拉菲（LAFITE）遨迪诺古堡上梅多克源自拉菲罗斯柴尔德红葡萄酒 750ml*6 木箱装（原岩石古堡）","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/156023/39/689/135834/5fdacf38Eef6083c7/bde21f051e6e6829.jpg"},{"sku":"5995789","name":"京东海外直采 格洛瑞亚年份波特酒葡萄酒 1970 葡萄牙杜罗河谷产区 750ml 原瓶进口","imagePath":"https://img13.360buyimg.com/n0/jfs/t15484/161/1568730955/107838/1f2c43a3/5a56e486N098aca7c.jpg"},{"sku":"8414194","name":"张裕 珍藏版五星金奖白兰地 700ml*6瓶 整箱礼盒装","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/142995/22/1792/342330/5efc5443Eab69f89a/074445d2806c6a1f.jpg"},{"sku":"5703580","name":"法国进口红酒 隆河丘产区AOC级别 歪脖子 芙华教皇新堡 红葡萄酒  礼盒装 750ml","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/139459/36/16331/66426/5fc4a614Eb4de57f6/3c2c9df3023d2e33.jpg"}]
let wineDefault2 = [{"sku":"100007897717","name":"青岛啤酒 TSINGTAO 皮尔森啤酒 麦芽浓度10.5度 酒精度≥4 麦香浓郁 酒味醇厚 整箱装 330ml*24","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/149108/22/3955/50307/5f1f8344E5abd74e5/bb2b947c800ce3d9.jpg"},{"sku":"1001423","name":"雪花啤酒（Snowbeer）8度纯生 330ml*24听 整箱装","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/126854/21/14391/122851/5f802570E9fe85c67/b1909d6f36ea35d0.jpg"},{"sku":"2863690","name":"燕京啤酒 12度 原浆白啤500ml*12听整箱装 上面酵母浓郁丁香花香气","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/147405/38/5559/124069/5f364e1dEd7a89529/69b4c4de2e1486bf.jpg"},{"sku":"100003304993","name":"哈尔滨 小麦王啤酒 550ml*20听 整箱装","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/35341/40/8060/182235/5cd531ebE38920bf0/b9cee24937294429.jpg"}]
let wineDefault3 = [{"sku":"7038920","name":"马爹利（Martell）洋酒 蓝带XO级 干邑 白兰地 1500ml 法国原装进口烈酒","imagePath":"https://img13.360buyimg.com/n0/jfs/t19300/155/1621638871/101183/82c5e74c/5ad046e8N8fd37811.jpg"},{"sku":"4794545","name":"芝华士（Chivas）洋酒 25年 苏格兰 威士忌 700ml","imagePath":"https://img13.360buyimg.com/n0/jfs/t17761/104/1266397541/103917/9991887f/5ac327feN83854fe1.jpg"},{"sku":"7252399","name":"马爹利（Martell）洋酒 蓝带XO级  傲创 干邑 白兰地 700ml 法国原装进口烈酒","imagePath":"https://img13.360buyimg.com/n0/jfs/t20023/279/302553457/49026/2378ae23/5aefb3aaN26a2c1f6.jpg"},{"sku":"331309","name":"百龄坛（Ballantine’s）洋酒 30年 苏格兰 威士忌 700ml","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/26503/22/12644/91913/5c99df5eE683aad2a/c76f8ceafbf4caeb.jpg"}]

//化妆品第一页
let cosmeticsDefault0 = [{"sku":"100008125331","name":"海蓝之谜 LA MER 浓缩修护精华露50ml （修护 精华）精美礼盒装 送女友 送老婆","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/138373/28/5727/127545/5f3c8897E0bdbc546/728e3f4bf7c2b191.png"},{"sku":"4797062","name":"SK-II神仙水330ml精华液护肤品套装化妆品礼盒  skiisk2 补水保湿 均匀肤色 囤货装 女生新年礼物","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/95414/16/13260/289041/5e572fb2Ee03fc3f4/12144e0829564026.png"},{"sku":"189795","name":"雅诗兰黛（Estee Lauder）鲜亮焕采泡沫洁面乳125ml(鲜活亮采红石榴洗面奶二合一)","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/109817/13/6448/133333/5e4b3f06E5a09300e/7ca838e3c5a33e45.png"},{"sku":"100015089896","name":"雅诗兰黛（Estee Lauder）特润修护肌活精华露75ml (礼盒装 全新第七代小棕瓶精华）","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/131519/32/9684/146247/5f5c3be2E55be2607/2f0671da355e5a4f.png"}]
let cosmeticsDefault1 = [{"sku":"100009596169","name":"迪奥(dior)全新烈艳蓝金雪夜星梦限量版口红礼盒(滋润999+哑光999+哑光888+666+772+844)唇膏女 新品礼物","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/150650/20/9444/590557/5fcc3d8eEbcea7ce9/de7f5e3f594bd80f.png"},{"sku":"5699726","name":"海蓝之谜（LA MER）鎏光焕变粉底液 02 SPF 20 30ml（02#象牙白） 送女友 送老婆","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/149457/4/780/256487/5ee86e31Efd77b405/bcdecadfffd3ef62.png"},{"sku":"100010432878","name":"圣罗兰（YSL）小金条口红礼盒四支装（09#+12#+21#+23# 礼盒随机 新年礼物）","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/85916/13/16482/249163/5e7ab4e6E979cd394/85e7d4c374a3e4f3.png"},{"sku":"761684","name":"香奈儿（Chanel）邂逅香水（瓶装）100ml（礼盒装） 送女友 送老婆","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/145393/7/18850/97569/5fdb1d5cE479bc983/e0075720ab7b8c1b.jpg"}]
let cosmeticsDefault2 = [{"sku":"100005140789","name":"屈臣氏天丝美容洁面巾50片 加厚干湿两用亲肤一次性盒装洗脸巾棉柔巾擦脸巾","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/45206/29/12850/288707/5d9dac02E8d44a8a5/0bd92a369865c253.jpg"},{"sku":"100011933782","name":"玻儿（populart ） 三支装立体粉扑（BB霜海绵粉底扑化妆粉扑）","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/106132/15/15579/224207/5e719b03E2210d1e0/d3951cca31e937da.jpg"},{"sku":"100006700010","name":"魅丝蔻（MSQ）13支白月光化妆刷套装 光刷无刷包无刷桶眼影刷腮红散粉刷化妆刷子套装七夕情人节礼物","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/89563/4/13383/253448/5e573273E266a82fc/be97e6deae21f037.png"},{"sku":"3153410","name":"美肤语微距剃毛刀两支装MF5006 （日本进口刀片 刮毛刀剃毛器脱毛男女剃腋毛阴毛刀）","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/125225/35/4496/136199/5edf028fE1f26db61/1c948c6e1adf32dd.png"}]
let cosmeticsDefault3 = [{"sku":"3285776","name":"SK-II男士神仙水230ml精华液护肤品套装化妆品礼盒（礼盒内赠洗面奶+清莹露）skiisk2  女生新年礼物","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/92406/20/13462/255564/5e572a21E4640da46/2f6572bda90714b3.png"},{"sku":"4934875","name":"倩碧（CLINIQUE）男士活炭净爽洁面乳200ml（男士 洗面奶 控油 活性炭 细致毛孔 清洁 洁面乳）","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/167066/13/3641/128630/600a84dfE2cfcfa23/9436f5a022a96a26.jpg"},{"sku":"4980449","name":"雪花秀（Sulwhasoo）男士本润乳液90ml（化妆品 男士护肤 乳液 护肤品 ）","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/142899/38/825/131054/5ee873f9E058249ac/c2267b9e42b23240.png"},{"sku":"100000329902","name":"资生堂百优全新精纯乳霜50ml（补水 保湿 改善细纹 百优面霜 护肤品）","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/112458/35/6609/224007/5ebb4e89Ec57dc43e/7512c5bff46e8f5a.png"}]

//家电第一页
let electricalDefault0 = [{"sku":"100001996070","name":"【专享】苏泊尔 （SUPOR）电饭煲电饭锅5L大容量球釜内胆CFXB50FC8055-75（一键柴火饭）","imagePath":"https://img13.360buyimg.com/n0/jfs/t23017/52/2651667468/261254/eda68aff/5b8a3febN54697964.jpg"},{"sku":"100007864581","name":"九阳（Joyoung）破壁免洗豆浆机智能熬煮多功能 轻松预约 DJ15E-K350","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/142541/32/5421/140670/5f374206Ed2996a81/fc683d1db70d0f45.png"},{"sku":"100007481549","name":"苏泊尔（SUPOR） 电磁炉微晶面板大火力智能定时过热断电保护C22-IH80Q","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/135566/10/1154/64026/5ed60a72E5b7735b0/69bc201b0461be9d.jpg"},{"sku":"100014210642","name":"九阳 Joyoung 家用多功能 空气炸锅 不沾易清洗 准确定时 低脂 无油煎炸 5.5L大容量 薯条机 KL55-VF531","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/128316/31/13473/332125/5f6d5f5bE736c3778/120634a085e2e358.png"}]
let electricalDefault1 = [{"sku":"100004854088","name":"迪斯(Desleep)美国迪斯按摩椅家用全身DE-T100L 贵宾咖 SL型导轨3D仿真机芯太空舱按摩椅 免安装 京品家电","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/91855/7/13403/435295/5e572d0bEb1f8f8e2/532ca8f53d8d1b60.png"},{"sku":"100005989716","name":"松下（Panasonic）按摩椅家用全自动电动多功能智能小型皮革滑躺设计精选推荐EP-MA04-T492 深茶色","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/103887/7/13221/389760/5e571c10E95e5908f/1b538f7a1af4fb74.png"},{"sku":"100016133848","name":"泰昌（Taicn） 熏蒸足浴盆洗脚盆家用 滚轮按摩足浴器 电动加热恒温泡脚深桶足疗盆 TC-C1106","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/154213/30/2791/85303/5f8d51dcEa0f83e72/1147dc0d7e8b6353.jpg"},{"sku":"1752775","name":"倍轻松（breo）智能头部按摩器iDream5s 头部眼部按摩仪 头皮按摩 头眼按摩头盔 新年礼物","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/96351/8/14940/502032/5e6b0e42E5d72090e/00754d877745570d.png"}]
let electricalDefault2 = [{"sku":"100004771187","name":"康佳（KONKA）405升 对开门冰箱 风冷无霜 隐藏式把手 金色 企业购专供 BCD-405WD5EGX","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/74736/36/10429/71397/5d7efdb6E2c7dfdd8/7518024b6f7b2d95.jpg"},{"sku":"100011111594","name":"小天鹅(LittleSwan)10公斤洗烘一体 滚筒洗衣机全自动 智能家电 银离子除菌 全触摸屏TD100V62WADY5","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/97938/3/12756/258871/5e4f336fEdb9c58a4/fc77b6fc9587c9a9.png"},{"sku":"100007875371","name":"格力 (GREE)冷静王-Ⅲ 大1匹变频冷暖 一级能效空调挂机 线下同款 KFR-26GW/(26549)FNhAa-A1(WIFI) 皓雪白","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/144332/24/3157/86308/5f112963Eed30c6ce/fdab1ca4a64d8b1f.png"},{"sku":"8461607","name":"康佳（KONKA）43英寸 LED43G30UE 4K超高清智能电视 黑色","imagePath":"https://img13.360buyimg.com/n0/jfs/t23749/163/1091568666/370119/5294e2ec/5b5043acNcc20bd73.jpg"}]
let electricalDefault3 = [{"sku":"100008841630","name":"康佳（KONKA）取暖器家用/电暖器/移动地暖/踢脚线 暖气/电热 数码遥控 可壁挂 KH-TJX20H02S","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/127371/15/16824/246675/5f9e56ddEe96f3793/c1b3996a4bd57f57.png"},{"sku":"100008151831","name":"飞利浦（PHILIPS）空气净化器 家用除甲醛除病毒除细菌PM2.5  除过敏源AC1758","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/118909/19/9734/59303/5edf30f0Eed74a037/b93399f3119d88a4.jpg"},{"sku":"100013466098","name":"志高（CHIGO） 智能吸尘器家用扫地机器人吸扫拖一体扫地机ZGS-246红色","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/113737/28/8107/132082/5ecb5755Ec596e8ce/4135909805e300b4.jpg"},{"sku":"100015943964","name":"海尔（Haier）YR1662-RO海尔净水器家用壁挂净饮反渗透过滤加热一体直饮厨房饮水机（线下同款）","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/132187/20/18010/631036/5fc5b308E3cfd238d/83169b4fe911098e.png"}]

//生活好物第一页
let suppliesDefault0 = [{"sku":"100009867985","name":"徐福记 福牛聚运糖点零食大礼包2454g 礼盒装 休闲零食","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/147834/17/18342/101355/5fd78d15E09f278de/fc52f0d9032eb1cb.jpg"},{"sku":"100016843546","name":"如水 千禧万福坚果礼盒3.24kg/盒 年货高端礼盒 春节送礼礼品团购（6罐装）","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/152646/2/9884/81193/5fd8a6b4Ecb984457/9cce332ddc248c2f.jpg"},{"sku":"4622537","name":"来伊份 天天坚果 每日坚果30包孕妇零食混合干果零食大礼包小袋装750g/盒","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/129209/15/13590/130894/5f702303E855480a3/13de73fcb78d5911.jpg"},{"sku":"100004158107","name":"三只松鼠宠爱巨型零食礼包20袋 年货零食大礼包节日礼物送女友礼物儿童鸭肉零食坚果果干/4.5斤","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/97737/22/13197/539521/5e571bc5E791b0993/4a82042af7303452.png"}]
let suppliesDefault1 = [{"sku":"100008939431","name":"福临门 雪国冰姬吉林小町香米 东北大米 吉林大米 中粮出品 5kg","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/135599/10/20243/115745/5fdad2cbEa3558960/961a19278859c4bd.jpg"},{"sku":"100016753518","name":"乔府大院 五常大米 当季新米 政府溯源防伪保真 绿色食品 东北大米2.5kg","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/156102/22/2863/129675/5fea935dE874b303a/71e4a890a1f0da82.jpg"},{"sku":"100016199428","name":"金龙鱼非转基因压榨 阳光零反式脂肪甾醇玉米油5L","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/155692/34/1815/71438/5fe40a90E43b8e416/60e15f9fbe0c428a.jpg"},{"sku":"100009186551","name":"胡姬花 金衣玉食古法花生油5L食用油压榨花生油","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/156740/17/1792/94419/5fe435a5E9a1b3ffc/b6adbb0114b91e48.jpg"}]
let suppliesDefault2 = [{"sku":"100016421896","name":"罗莱家纺 LUOLAI 四件套 床品套件 纯棉床单被套 缤纷花音四件套 200*230","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/125608/31/16842/143894/5f9f985fE1aaea565/8f8dddb5611b53f6.jpg"},{"sku":"100005270490","name":"3M 进口多功能食品密封袋 母乳零食果蔬双链条保鲜袋 大号","imagePath":"https://img13.360buyimg.com/n0/jfs/t10897/56/2806675357/282543/8814b4f3/5cd8cc24Nc11c441a.jpg"},{"sku":"100001654538","name":"洁丽雅兰毛巾家居3件套舒适吸水加大面巾浴巾加厚人洗脸绣花擦脸巾薰衣草毛巾盒装*2白76*33 浴巾140*70","imagePath":"https://img13.360buyimg.com/n0/jfs/t30859/129/18815100/118987/daccaf63/5be5650dN495bed5e.jpg"},{"sku":"2941978","name":"贝瑟斯 洗澡神器4件套装 强力拉背条搓澡巾 搓背长条 沐浴球 浴花 男士女生去角质 戳澡巾沐浴棉洗浴用品刷具","imagePath":"https://img13.360buyimg.com/n0/jfs/t12346/58/2304479457/211004/aab25f76/5a3a14cbN846dc525.jpg"}]
let suppliesDefault3 = [{"sku":"2877592","name":"清风（APP）抽纸 原木纯品金装系列 3层120抽软抽*24包纸巾 婴儿可用（整箱销售）","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/102949/33/12239/666659/5e44a7aeE9baf22cb/d7485ba248c208b6.png"},{"sku":"100011356736","name":"心相印竹π竹派本色抽纸无漂白竹浆本色纸 3层100抽软抽纸巾*24包装（整箱售卖）","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/85240/10/16130/446160/5e796345E55e5759d/df0442017176cd28.png"},{"sku":"2015244","name":"清风 (APP) 卷纸 原木纯品金装系列 4层加厚200克卫生纸*27卷 (母婴可用 湿水不易破新老包装随机发货）","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/142889/28/15081/321414/5fb7248cE391f4332/67324d49358389ae.png"},{"sku":"100006279785","name":"心相印 竹π竹派竹浆竹醌抑菌本色纸卷纸2粒装75节2层印花厨房纸巾*4提（整箱售卖）","imagePath":"https://img13.360buyimg.com/n0/jfs/t1/96968/15/16264/420880/5e796333Ee47101dc/bd67917d1fcde8b4.png"}]

//酒类商品
let wineGoods = [
    {
        "name":"白酒",
        "nomore":false,
        "isLoad":false,
        "loading":false,
        "goodsList":wineDefault0,
        "goodsSkus":["100005907830","100003547337","6120121","4838539","100005483298","100016492148","16712419326","1185333","8427519","7721853","4695761","781482","791042","100012417288","1075528","8340073","4236314","791041","1129071","5911581","884953","100010792524","1240792","100009836429","5562958","100015470986","4746012","4695789","7571970","3280970","16712419327","1201330","8261725","7814569"]
    },
    {
        "name":"红酒",
        "nomore":false,
        "isLoad":false,
        "loading":false,
        "goodsList":wineDefault1,
        "goodsSkus":["100006811901","5995789","8414194","5703580","100000388683","1637528","100012422008","100007023226","5375285","10691946780","51189004536","701312","51174587852","7675417","1624356","7675413","407967","7675427","5775839","4797584","5872334","5638566","5988508","100002951548","6474116","5604682","58683156332","407965","100006289548","2055110","100006532126","2133753","5939336","2235846","100005492008","100003859079","8621740","1015007"]
    },
    {
        "name":"啤酒",
        "nomore":false,
        "isLoad":false,
        "loading":false,
        "goodsList":wineDefault2,
        "goodsSkus":["100007897717","1001423","2863690","100003304993","1032730","100007019346","3602946","1267378","703211","8181176","100007898455","100012864432","8393323","8833985","5458744","100005262049","100005423930","846169","4556181","1516151","5455393","1320369","3611334","2294451","4675389","100009512602","4874136","100006769660","1301056","1032725","100010617382","987414","703214","100014116236","100013467150","100007599727","987407","1065169","100005879643","100003036367","100012157576","1032745"]
    },
    {
        "name":"洋酒",
        "nomore":false,
        "isLoad":false,
        "loading":false,
        "goodsList":wineDefault3,
        "goodsSkus":["7038920","4794545","7252399","331309","1454970","3830135","331326","394173","100005919966","285995","812413","1455049","501616","4662137","331310","331335","100016241048","27474744960","7705085","100009742800","3448857","8780362","1226878","7252403","100000761077","625029","3482387","2839072","331332","5879214","100005316780","1087017","3758957","776805","1087020","1082012","3176326","332105","100003272853","2316410"]
    },
]

//化妆品商品
let cosmeticsGoods = [
    {
        "name":"女士护肤",
        "nomore":false,
        "isLoad":false,
        "loading":false,
        "goodsList":cosmeticsDefault0,
        "goodsSkus":["100008125331","4797062","189795","100015089896","2224093","100013528990","100011339154","100000853901","1346464","100011480230","100008719635","2223526","100016206884","2439285","230794","100007111851","631452","892498","1125641","2224115","100008529598","364803","100011136238","100009101355","100015446188","100008730881","100015387394","100016002486","8309072","100008046937","6088552","100010493352","1340256","100003140728","100002382348","100001835860","100016602042","100016281334","100008125337","100000389039","100008529805","100000964569","100006374354","100007064689","100006946591","100008262840","4894721","100009144609","100008130645","100010895196","100017006328","100011228290","100008102898","100015373446","4247174","4434574","100014602250","100007308653","100001198058","100012923996"]
    },
    {
        "name":"香水彩妆",
        "nomore":false,
        "isLoad":false,
        "loading":false,
        "goodsList":cosmeticsDefault1,
        "goodsSkus":["100009596169","5699726","100010432878","761684","100013377374","100014972324","3389696","100009241311","816495","729740","100002380712","100005559724","826859","100016911138","100000964551","3597970","1289035","3369677","100008451155","100003561573","100006584727","100007086044","100007355971","100015669062","100009800955","100011323932","100005323992","100010958840","100007205247","100002425065","2326274","100003201290","100000807422","100016070320","100006117186","100015339040","2788664","1211741","100006044096","100017002882","100008287545","100000395387"]
    },
    {
        "name":"美妆工具",
        "nomore":false,
        "isLoad":false,
        "loading":false,
        "goodsList":cosmeticsDefault2,
        "goodsSkus":["100005140789","100011933782","100006700010","3153410","100001263445","100008927951","100006364428","251743","100017198116","4070841","100005571696","100011933760","100006316521","100012555160","100016298574","6971076","100005863713","100008796096","100012445282","7475437","100008556211","100004330965","100016396250","100016396160","100005815161","100007020850","100009851545","1851715","5307414","4315662","5307418","4838834","100009851523","4186232","16056900702","100001065304","2171465","2656847"]
    },
    {
        "name":"男士护肤",
        "nomore":false,
        "isLoad":false,
        "loading":false,
        "goodsList":cosmeticsDefault3,
        "goodsSkus":["3285776","4934875","4980449","100000329902","4856431","100001928579","7214568","3285818","100000197679","100007474452","6267201","100012036700","100007324598","602102","7229954","3334364","100014820816","1041017","100004050607","100004750128","100002844569","100007324754","5185753","100008577636","5185755","100013693440","1041004","100004210753","296974","188606","100007395750","100007217739","100002847580","100000166840","100006895227","100000388925","100007575032","100015485634","100008348694","100011088778","1335925","100008893068","2504661","7836866","411095","100002186709"]
    },
]

//家电专场商品
let electricalGoods = [
    {
        "name":"厨房小电",
        "nomore":false,
        "isLoad":false,
        "loading":false,
        "goodsList":electricalDefault0,
        "goodsSkus":["100001996070","100007864581","100007481549","100014210642","100013822632","100016548904","100016708998","100013775964","100015623902","100014142328","100005961277","100005278307","100007457767","100012721008","100009563162","100009323815","100015090676","1771494","100009737554","100005465597","7383148","100008792648","100006539136","100009641770","100013473388","100009559033","100008801454","100008757938","100012881312","100014178568","100003442301","100007592957","100004688976","100013925870","100013860200","100005014561","100011818942","100009559035"]
    },
    {
        "name":"个护电器",
        "nomore":false,
        "isLoad":false,
        "loading":false,
        "goodsList":electricalDefault1,
        "goodsSkus":["100004854088","100005989716","100016133848","1752775","100007012283","100006275852","100013240032","100009016535","100006079511","100011095014","100001323593","100008897199","100000616317","100009937506","100002384758","100011095012","100005026437","1351714","100016368144","100006913519","8484149","8235526","100008322811","100006913513","100000819690","100010639416","100001758749","100004807499","3829536","100009620641","100013207996","100007002397","100005734778","100009752631","100005717967","100009081752","100001009660","2305829","100006188374","100010604214","100005134556","100013469272","100012622198","100006640850","100008388447","100016821206","1096711","100012622262","100010959280","100013598140","100013234258","100013674106","100006377782","100017034356","100016684586","100016612844","100016684568","100016117470"]
    },
    {
        "name":"家用电器",
        "nomore":false,
        "isLoad":false,
        "loading":false,
        "goodsList":electricalDefault2,
        "goodsSkus":["100004771187","100011111594","100007875371","8461607","100005927181","100007380473","100008494476","100001971753","100008793518","100003836729","100002329687","100001798047","100012969862","100006787323","100012975446","7321846","100014057490","100004652001","7243108","100000249145","100006501342","100012719930","100007886309","100015137132","8826867","100015285492","100008943295","100011898340","100011742154","100000249075"]
    },
    {
        "name":"生活电器",
        "nomore":false,
        "isLoad":false,
        "loading":false,
        "goodsList":electricalDefault3,
        "goodsSkus":["100008841630","100008151831","100013466098","100015943964","100004796431","100011303062","100014669684","100006570846","4502061","100014867466","100013466106","100013558118","100005857777","100009879641","100008558077","100008893092","6106177","100016601680","100000019486","100009286081","184793","100016762528","100004547016","100006079531","100015758598","100004796433","100008409467","100008226049"]
    },
]

//生活好物商品
let suppliesGoods = [
    {
        "name":"食品饮料",
        "nomore":false,
        "isLoad":false,
        "loading":false,
        "goodsList":suppliesDefault0,
        "goodsSkus":["100009867985","100016843546","4622537","100004158107","100015627858","100016397720","2186644","100003573777","1975749","100016466644","100006057399","100007331791","100009398254","2518095","5662847","100012255824","1287630","3227490","1904988","100017180270","100015589350","6169700","100005956259","100005956197","100002655472","1715399","2216924","100014563496","100008162598","1083759","4476604","7125375","100017381294","100016771850","100011262520","100002824392","100004887404","1178899","6010325","100014376698","100012420682","4456441","1178028","100015722426","3626347","4351633"]
    },
    {
        "name":"粮油调味",
        "nomore":false,
        "isLoad":false,
        "loading":false,
        "goodsList":suppliesDefault1,
        "goodsSkus":["100008939431","100016753518","100016199428","100009186551","100006663888","100009591622","100006813726","5940788","4217474","100003074138","100015729800","100006040455","3437980","100009119912","100007604888","100009330845","100008939431","100006370453","100016199408","100014065578","100016753518","100014774326","100010258984","100016925364","100008762516","100008806830","100008793496","100004051247","100000255313","5940788","3437980","100009119912","4217474","100003350736","100003762275","100006040455","1552835","100007604888","100009330845","100013412644","100005230443","100012636478","100004051247","100000255313","100015729800","100005882917","2046455","5489751","4176174","4780255","4528212","100017050986"]
    },
    {
        "name":"家居日用",
        "nomore":false,
        "isLoad":false,
        "loading":false,
        "goodsList":suppliesDefault2,
        "goodsSkus":["100016421896","100005270490","100001654538","2941978","100017273988","100013315702","100009944289","100006979119","100011882048","7854376","100013217532","100007538056","100013391318","100005457938","100007952221","100003429790","100009944275","100012236774","100015543802","100011978622","100004192104","100015413896","100010633968","100007265707","100012625986","4091655","100015024090","100012977004","100006490077","100016844982","100011950854","100012600234","100007449383","851785","100008344407","100012799650","100010566746","100013080536","100014668586","100007065045"]
    },
    {
        "name":"清洁纸品",
        "nomore":false,
        "isLoad":false,
        "loading":false,
        "goodsList":suppliesDefault3,
        "goodsSkus":["2877592","100011356736","2015244","100006279785","100013265164","100007064951","100013080544","100008766160","100011421228","8589412","100000469054","100015114144","100010633988","100013377246","100005333904","100011380504","100002513531","100010338248","4510088","100013180542","100010704940","100007015605","100001740894","100004029002","1075103","1215822","100012797322","5154576","4486428","100016002094"]
    },
]

//年货大集商品信息酒类-化妆-家电-生活
export const activityGoodsGroup = {
    wine:{
        goods:wineGoods,
        pageThemes:{
            pagebgimg:require('../../../../../themes/default/img/activity/carnival/bg_shangyun_mingjiu@2x.png'),
            pagebgColor:'#D82122',
            tabColor:'#E44127',
            tabBgColor:'#FDECDD'
        }
    },
    cosmetics:{
        goods:cosmeticsGoods,
        pageThemes:{
            pagebgimg:require('../../../../../themes/default/img/activity/carnival/bg_shangyun_zhenxuanmeizhuang@2x.png'),
            pagebgColor:'#FE849C',
            tabColor:'#E25A76',
            tabBgColor:'#FDEDDE'
        }
    },
    electrical:{
        goods:electricalGoods,
        pageThemes:{
            pagebgimg:require('../../../../../themes/default/img/activity/carnival/bg_shangyun_jiadian@2x.png'),
            pagebgColor:'#6FBAFE',
            tabColor:'#458DCF',
            tabBgColor:'#E5FBFD'
        }
    },
    supplies:{
        goods:suppliesGoods,
        pageThemes:{
            pagebgimg:require('../../../../../themes/default/img/activity/carnival/bg_shangyun_nianhuodaji@2x.png'),
            pagebgColor:'#FF4107',
            tabColor:'#F54917',
            tabBgColor:'#FEEECC'
        }
    },
}
